# Read CSV Data

In [72]:
import pandas as pd
read1=pd.read_csv("./csv1.csv")
print(read1)

   JE Code      Store       Country       Date             Item  List Price
0   I-1001     Moscow        Russia   10-06-18        Microwave          80
1   I-1002    Toronto        Canada  4/23/2015        Microwave          80
2   I-1003  Sao Paolo        Brazil   04-03-17  Air conditioner         700
3   I-1004   Istanbul        Turkey  8/14/2018      Ceiling fan         150
4   I-1005     Sydney     Australia   03-03-15          Toaster          50
5   I-1006   Shenzhen         China  4/25/2016             Iron          30
6   I-1007       Lima          Peru   06-06-16       Dishwasher         500
7   I-1008    Tijuana        Mexico   06-07-16             Iron          30
8   I-1009     London            UK   12-11-15  Washing Machine         800
9   I-1010       Lima          Peru   09-07-14             Iron          30
10  I-1011     Riyadh  Saudi Arabia   10-07-17     Refrigerator        1000
11  I-1012    Bangkok      Thailand  8/21/2014  Air conditioner         700
12  I-1013    Tijuana        Mexico   03-09-15             Iron          30
13  I-1014      Delhi         India  5/30/2014             Oven         500
14  I-1015     Sydney     Australia   11-12-18  Washing Machine         800
15  I-1016  Minh City       Vietnam  5/24/2015        Microwave          80
16  I-1017   Tel Aviv        Israel   12-06-14     Refrigerator        1000

In [73]:
read1.index

RangeIndex(start=0, stop=17, step=1)

In [74]:
read1.columns

Index(['JE Code', 'Store', 'Country', 'Date', 'Item', 'List Price'], dtype='str')

In [75]:
read1.describe()

        List Price
count    17.000000
mean    385.882353
std     377.194559
min      30.000000
25%      50.000000
50%     150.000000
75%     700.000000
max    1000.000000

In [76]:
read1.head()

  JE Code      Store    Country       Date             Item  List Price
0  I-1001     Moscow     Russia   10-06-18        Microwave          80
1  I-1002    Toronto     Canada  4/23/2015        Microwave          80
2  I-1003  Sao Paolo     Brazil   04-03-17  Air conditioner         700
3  I-1004   Istanbul     Turkey  8/14/2018      Ceiling fan         150
4  I-1005     Sydney  Australia   03-03-15          Toaster          50

In [77]:
read1.head(2)

  JE Code    Store Country       Date       Item  List Price
0  I-1001   Moscow  Russia   10-06-18  Microwave          80
1  I-1002  Toronto  Canada  4/23/2015  Microwave          80

In [78]:
read1.tail(2)

   JE Code      Store  Country       Date          Item  List Price
15  I-1016  Minh City  Vietnam  5/24/2015     Microwave          80
16  I-1017   Tel Aviv   Israel   12-06-14  Refrigerator        1000

In [79]:
read1.tail()

   JE Code      Store    Country       Date             Item  List Price
12  I-1013    Tijuana     Mexico   03-09-15             Iron          30
13  I-1014      Delhi      India  5/30/2014             Oven         500
14  I-1015     Sydney  Australia   11-12-18  Washing Machine         800
15  I-1016  Minh City    Vietnam  5/24/2015        Microwave          80
16  I-1017   Tel Aviv     Israel   12-06-14     Refrigerator        1000

In [80]:
read1[5:11]

   JE Code     Store       Country       Date             Item  List Price
5   I-1006  Shenzhen         China  4/25/2016             Iron          30
6   I-1007      Lima          Peru   06-06-16       Dishwasher         500
7   I-1008   Tijuana        Mexico   06-07-16             Iron          30
8   I-1009    London            UK   12-11-15  Washing Machine         800
9   I-1010      Lima          Peru   09-07-14             Iron          30
10  I-1011    Riyadh  Saudi Arabia   10-07-17     Refrigerator        1000

In [81]:
read1.index.array

<NumpyExtensionArray>
[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16]
Length: 17, dtype: int64

In [82]:
read1.to_numpy()

array([['I-1001', 'Moscow', 'Russia', '10-06-18', 'Microwave', 80],
       ['I-1002', 'Toronto', 'Canada', '4/23/2015', 'Microwave', 80],
       ['I-1003', 'Sao Paolo', 'Brazil', '04-03-17', 'Air conditioner',
        700],
       ['I-1004', 'Istanbul', 'Turkey', '8/14/2018', 'Ceiling fan', 150],
       ['I-1005', 'Sydney', 'Australia', '03-03-15', 'Toaster', 50],
       ['I-1006', 'Shenzhen', 'China', '4/25/2016', 'Iron', 30],
       ['I-1007', 'Lima', 'Peru', '06-06-16', 'Dishwasher', 500],
       ['I-1008', 'Tijuana', 'Mexico', '06-07-16', 'Iron', 30],
       ['I-1009', 'London', 'UK', '12-11-15', 'Washing Machine', 800],
       ['I-1010', 'Lima', 'Peru', '09-07-14', 'Iron', 30],
       ['I-1011', 'Riyadh', 'Saudi Arabia', '10-07-17', 'Refrigerator',
        1000],
       ['I-1012', 'Bangkok', 'Thailand', '8/21/2014', 'Air conditioner',
        700],
       ['I-1013', 'Tijuana', 'Mexico', '03-09-15', 'Iron', 30],
       ['I-1014', 'Delhi', 'India', '5/30/2014', 'Oven', 500],
       ['I-1015', 'Sydney', 'Australia', '11-12-18', 'Washing Machine',
        800],
       ['I-1016', 'Minh City', 'Vietnam', '5/24/2015', 'Microwave', 80],
       ['I-1017', 'Tel Aviv', 'Israel', '12-06-14', 'Refrigerator', 1000]],
      dtype=object)

In [83]:
import numpy as np
v=np.asarray(read1)
v

array([['I-1001', 'Moscow', 'Russia', '10-06-18', 'Microwave', 80],
       ['I-1002', 'Toronto', 'Canada', '4/23/2015', 'Microwave', 80],
       ['I-1003', 'Sao Paolo', 'Brazil', '04-03-17', 'Air conditioner',
        700],
       ['I-1004', 'Istanbul', 'Turkey', '8/14/2018', 'Ceiling fan', 150],
       ['I-1005', 'Sydney', 'Australia', '03-03-15', 'Toaster', 50],
       ['I-1006', 'Shenzhen', 'China', '4/25/2016', 'Iron', 30],
       ['I-1007', 'Lima', 'Peru', '06-06-16', 'Dishwasher', 500],
       ['I-1008', 'Tijuana', 'Mexico', '06-07-16', 'Iron', 30],
       ['I-1009', 'London', 'UK', '12-11-15', 'Washing Machine', 800],
       ['I-1010', 'Lima', 'Peru', '09-07-14', 'Iron', 30],
       ['I-1011', 'Riyadh', 'Saudi Arabia', '10-07-17', 'Refrigerator',
        1000],
       ['I-1012', 'Bangkok', 'Thailand', '8/21/2014', 'Air conditioner',
        700],
       ['I-1013', 'Tijuana', 'Mexico', '03-09-15', 'Iron', 30],
       ['I-1014', 'Delhi', 'India', '5/30/2014', 'Oven', 500],
       ['I-1015', 'Sydney', 'Australia', '11-12-18', 'Washing Machine',
        800],
       ['I-1016', 'Minh City', 'Vietnam', '5/24/2015', 'Microwave', 80],
       ['I-1017', 'Tel Aviv', 'Israel', '12-06-14', 'Refrigerator', 1000]],
      dtype=object)

In [84]:
read1.sort_index(axis=0,ascending=False)

   JE Code      Store       Country       Date             Item  List Price
16  I-1017   Tel Aviv        Israel   12-06-14     Refrigerator        1000
15  I-1016  Minh City       Vietnam  5/24/2015        Microwave          80
14  I-1015     Sydney     Australia   11-12-18  Washing Machine         800
13  I-1014      Delhi         India  5/30/2014             Oven         500
12  I-1013    Tijuana        Mexico   03-09-15             Iron          30
11  I-1012    Bangkok      Thailand  8/21/2014  Air conditioner         700
10  I-1011     Riyadh  Saudi Arabia   10-07-17     Refrigerator        1000
9   I-1010       Lima          Peru   09-07-14             Iron          30
8   I-1009     London            UK   12-11-15  Washing Machine         800
7   I-1008    Tijuana        Mexico   06-07-16             Iron          30
6   I-1007       Lima          Peru   06-06-16       Dishwasher         500
5   I-1006   Shenzhen         China  4/25/2016             Iron          30
4   I-1005     Sydney     Australia   03-03-15          Toaster          50
3   I-1004   Istanbul        Turkey  8/14/2018      Ceiling fan         150
2   I-1003  Sao Paolo        Brazil   04-03-17  Air conditioner         700
1   I-1002    Toronto        Canada  4/23/2015        Microwave          80
0   I-1001     Moscow        Russia   10-06-18        Microwave          80

In [85]:
read1["Store"][1]="Sumit"
read1

C:\Users\pc\AppData\Local\Temp\ipykernel_8968\2551433719.py:1: ChainedAssignmentError: A value is being set on a copy of a DataFrame or Series through chained assignment.
Such chained assignment never works to update the original DataFrame or Series, because the intermediate object on which we are setting values always behaves as a copy (due to Copy-on-Write).

Try using '.loc[row_indexer, col_indexer] = value' instead, to perform the assignment in a single step.

See the documentation for a more detailed explanation: https://pandas.pydata.org/pandas-docs/stable/user_guide/copy_on_write.html#chained-assignment
  read1["Store"][1]="Sumit"

   JE Code      Store       Country       Date             Item  List Price
0   I-1001     Moscow        Russia   10-06-18        Microwave          80
1   I-1002    Toronto        Canada  4/23/2015        Microwave          80
2   I-1003  Sao Paolo        Brazil   04-03-17  Air conditioner         700
3   I-1004   Istanbul        Turkey  8/14/2018      Ceiling fan         150
4   I-1005     Sydney     Australia   03-03-15          Toaster          50
5   I-1006   Shenzhen         China  4/25/2016             Iron          30
6   I-1007       Lima          Peru   06-06-16       Dishwasher         500
7   I-1008    Tijuana        Mexico   06-07-16             Iron          30
8   I-1009     London            UK   12-11-15  Washing Machine         800
9   I-1010       Lima          Peru   09-07-14             Iron          30
10  I-1011     Riyadh  Saudi Arabia   10-07-17     Refrigerator        1000
11  I-1012    Bangkok      Thailand  8/21/2014  Air conditioner         700
12  I-1013    Tijuana        Mexico   03-09-15             Iron          30
13  I-1014      Delhi         India  5/30/2014             Oven         500
14  I-1015     Sydney     Australia   11-12-18  Washing Machine         800
15  I-1016  Minh City       Vietnam  5/24/2015        Microwave          80
16  I-1017   Tel Aviv        Israel   12-06-14     Refrigerator        1000

In [86]:
read1.loc[1,"Store"]="Rohan"
read1

   JE Code      Store       Country       Date             Item  List Price
0   I-1001     Moscow        Russia   10-06-18        Microwave          80
1   I-1002      Rohan        Canada  4/23/2015        Microwave          80
2   I-1003  Sao Paolo        Brazil   04-03-17  Air conditioner         700
3   I-1004   Istanbul        Turkey  8/14/2018      Ceiling fan         150
4   I-1005     Sydney     Australia   03-03-15          Toaster          50
5   I-1006   Shenzhen         China  4/25/2016             Iron          30
6   I-1007       Lima          Peru   06-06-16       Dishwasher         500
7   I-1008    Tijuana        Mexico   06-07-16             Iron          30
8   I-1009     London            UK   12-11-15  Washing Machine         800
9   I-1010       Lima          Peru   09-07-14             Iron          30
10  I-1011     Riyadh  Saudi Arabia   10-07-17     Refrigerator        1000
11  I-1012    Bangkok      Thailand  8/21/2014  Air conditioner         700
12  I-1013    Tijuana        Mexico   03-09-15             Iron          30
13  I-1014      Delhi         India  5/30/2014             Oven         500
14  I-1015     Sydney     Australia   11-12-18  Washing Machine         800
15  I-1016  Minh City       Vietnam  5/24/2015        Microwave          80
16  I-1017   Tel Aviv        Israel   12-06-14     Refrigerator        1000

In [ ]:
# read1.loc[2:6,["Store","Country"]]

read1.loc[[2,6],["Store","Country"]]

       Store Country
2  Sao Paolo  Brazil
6       Lima    Peru

In [ ]:
read1.loc[[2,3],:]

  JE Code      Store Country       Date             Item  List Price
2  I-1003  Sao Paolo  Brazil   04-03-17  Air conditioner         700
3  I-1004   Istanbul  Turkey  8/14/2018      Ceiling fan         150

In [ ]:
read1.iloc[0,1]

'Moscow'

In [ ]:
read1.drop("Store",axis=1)

   JE Code       Country       Date             Item  List Price
0   I-1001        Russia   10-06-18        Microwave          80
1   I-1002        Canada  4/23/2015        Microwave          80
2   I-1003        Brazil   04-03-17  Air conditioner         700
3   I-1004        Turkey  8/14/2018      Ceiling fan         150
4   I-1005     Australia   03-03-15          Toaster          50
5   I-1006         China  4/25/2016             Iron          30
6   I-1007          Peru   06-06-16       Dishwasher         500
7   I-1008        Mexico   06-07-16             Iron          30
8   I-1009            UK   12-11-15  Washing Machine         800
9   I-1010          Peru   09-07-14             Iron          30
10  I-1011  Saudi Arabia   10-07-17     Refrigerator        1000
11  I-1012      Thailand  8/21/2014  Air conditioner         700
12  I-1013        Mexico   03-09-15             Iron          30
13  I-1014         India  5/30/2014             Oven         500
14  I-1015     Australia   11-12-18  Washing Machine         800
15  I-1016       Vietnam  5/24/2015        Microwave          80
16  I-1017        Israel   12-06-14     Refrigerator        1000